{"Title":"[PDF] AI-Driven Smart Contract Vulnerability Detection: A Systematic Review of Methods, Challenges, and Future Prospects ","Link":"https://scholar.google.com/scholar_url?url=https://mesopotamian.press/journals/index.php/bigdata/article/download/893/851&hl=en&sa=X&d=12330023021292636129&ei=mBG9aIOfFqOi6rQP5_nYaA&scisig=AAZF9b_7P-iu93c_o28izZTxCF_Y&oi=scholaralrt&hist=bI0g1IwAAAAJ:3768286445485410327:AAZF9b9oFBeJhVejWr3S4Kq2k1MP&html=&pos=0&folt=cit","Content":"SAL Azzam, RAL Kolandaisamy, GAL Dharhani - Mesopotamian Journal of Big ;Data, 2025Smart contracts (SCs) have become an essential component in the world of decentralized applications, automating transactions across blockchain networks without the need for intermediaries, and with this rise in adoption, the technology has also brought forth growing concern due to security vulnerabilities, which have led to serious financial damage, and the problem is far from being solved. Traditional auditing methods often struggle to capture the more intricate vulnerabilities hidden …• Cites: ‪Ethainter: a smart contract security analyzer for composite …‬  ","AuthorName":"GScholar : 2 new citations to articles by Yannis Smaragdakis","AuthorEmail":"https://scholar.google.com/scholar_alerts?view_op=list_alerts&hl=en","PubDate":null}
{"Title":"[PDF] Enhancing Semantic Understanding in Pointer Analysis using Large Language Models ","Link":"https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2508.21454&hl=en&sa=X&d=10937265225370721157&ei=mBG9aIOfFqOi6rQP5_nYaA&scisig=AAZF9b8xad9oNDMbj49Ym_hzfYqJ&oi=scholaralrt&hist=bI0g1IwAAAAJ:3768286445485410327:AAZF9b9oFBeJhVejWr3S4Kq2k1MP&html=&pos=1&folt=cit","Content":"Twitter] ;LinkedIn] Facebook] B Cheng, K Wang, L Shi, H Wang, Y Guo, D Li, X Chen - arXiv preprint arXiv …, 2025Pointer analysis has been studied for over four decades. However, existing frameworks continue to suffer from the propagation of incorrect facts. A major limitation stems from their insufficient semantic understanding of code, resulting in overly conservative treatment of user-defined functions. Recent advances in large language models (LLMs) present new opportunities to bridge this gap. In this paper, we propose LMPA (LLM-enhanced Pointer Analysis), a vision that integrates LLMs …• Cites: ‪Precision-guided context sensitivity for pointer analysis‬  ","AuthorName":"GScholar : 2 new citations to articles by Yannis Smaragdakis","AuthorEmail":"https://scholar.google.com/scholar_alerts?view_op=list_alerts&hl=en","PubDate":null}
{"Title":"[PDF] SoK: Large Language Model-Generated Textual Phishing Campaigns End-to-End Analysis of Generation, Characteristics, and Detection ","Link":"https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2508.21457&hl=en&sa=X&d=9665843585421496250&ei=mBG9aMDAK_mI6rQP1e7wmQQ&scisig=AAZF9b8m-xerwyUJ8cHaBpfT9ByH&oi=scholaralrt&hist=bI0g1IwAAAAJ:16392658711713318780:AAZF9b_IgszAt7wnLnnF2ZTHzs8b&html=&pos=0&folt=cit","Content":"F Chen, T Wu, V Nguyen, C Rudolph - arXiv preprint arXiv:2508.21457, 2025;Phishing is a pervasive form of social engineering in which attackers impersonate trusted entities to steal information or induce harmful actions. Text-based phishing dominates for its low cost, scalability, and concealability, advantages recently amplified by large language models (LLMs) that enable``Phishing-as-a-Service''attacks at scale within minutes. Despite the growing research into LLM-facilitated phishing attacks, consolidated systematic research on the phishing attack …• Cites: ‪Evaluating Large Language Models for Phishing Detection, Self …‬  ","AuthorName":"GScholar : 1 new citation to articles by Palvi Aggarwal","AuthorEmail":"https://scholar.google.com/scholar_alerts?view_op=list_alerts&hl=en","PubDate":null}
{"Title":"[PDF] E-PhishGen: Unlocking Novel Research in Phishing Email Detection ","Link":"https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2509.01791&hl=en&sa=X&d=14576870691362100957&ei=mBG9aPnxIIvWieoPvMmmcA&scisig=AAZF9b8T_eifXFS6wJQ4pyXndUI6&oi=scholaralrt&hist=bI0g1IwAAAAJ:6396055290396755400:AAZF9b_wzj_COAxj7vbWl6wzv-3Q&html=&pos=0&folt=rel","Content":"L Pajola, E Caripoti, S Pizzi, M Conti, S Banzer… - arXiv preprint arXiv …, ;2025Every day, our inboxes are flooded with unsolicited emails, ranging between annoying spam to more subtle phishing scams. Unfortunately, despite abundant prior efforts proposing solutions achieving near-perfect accuracy, the reality is that …","AuthorName":"GScholar : Palvi Aggarwal","AuthorEmail":"https://scholar.google.com/scholar_alerts?view_op=list_alerts&hl=en","PubDate":null}
{"Title":"[PDF] Cybersecurity AI: Hacking the AI Hackers via Prompt Injection ","Link":"https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2508.21669&hl=en&sa=X&d=8301113452662127606&ei=mBG9aLnuNZTTieoPmtq-4Q8&scisig=AAZF9b8trNTWcRjMplGZ7rAGh32T&oi=scholaralrt&hist=bI0g1IwAAAAJ:18136354366354301040:AAZF9b-pl7LYmi87tn1aUc1dis2W&html=&pos=0&folt=rel","Content":"V Mayoral-Vilches, PM Rynning - arXiv preprint arXiv:2508.21669, 2025;We demonstrate how AI-powered cybersecurity tools can be turned against themselves through prompt injection attacks. Prompt injection is reminiscent of cross-site scripting (XSS): malicious text is hidden within seemingly trusted content, and …","AuthorName":"GScholar : Cleotilde Gonzalez","AuthorEmail":"https://scholar.google.com/scholar_alerts?view_op=list_alerts&hl=en","PubDate":null}
